Repository: vermont42/Conjuguer
Catalog: Conjuguer/Assets/Localizable.xcstrings
Source language: en
Languages: fr

# Info.indicatifPrésentText
source: `Uses` The ~indicatif présent~ (present indicative) is used: • To describe continuing reality. “Mon mari prétend que je n’aime pas les fruits parce que j’en mange moins que lui.” = “My husband claims I don’t like fruit because I eat less of it than he does.” - Marcel Proust, Du côté de chez Swann • Similarly, to express the repeated or habitual nature of an action. English sometimes uses the construction ~have a habit of + gerund~ to accomplish this. “[O]ù que je me trouve, dès qu’ils commencent à retentir et à se répondre, je l’$aperÇOis$, avec ses tilleuls et son trottoir éclairé par la lune.” = “Wherever I find myself, as soon as they begin to ring and answer each other, I see it, with its lindens and its moonlit sidewalk.” - Marcel Proust, Du côté de chez Swann • To emphasize the ongoing character of an action. English uses the construction ~be + infinitive + -ing~ to accomplish this. “Vois-tu, je $saIs$ que tu m’attends.” = “You see, I know that you $ARE$ waiting for me.” - Victor Hugo, Demain dès l’aube • In situations where English uses the construction ~do + infinitive~ for emphasis. “Oh! très-sincèrement je $souffrE$” = “Oh very sincerely do I suffer!” - Charles Baudelaire, Le monstre, ou le paranymphe d’une nymphe macabre `Conjugation` For most verbs, the indicatif-présent stem is the infinitif minus the -er, -ir, -re, or -oir ending. The indicatif-présent endings for any verb belong to one of the following categories. 1. Regular ~er~ verbs plus couvrir, cueillir, and bouillir: e, es, e, ons, ez, ent Examples: ‡céder‡: $cÈde$, $cÈdes$, $cÈde$, cédons, cédez, $cÈdent$ ‡couvrir‡: $couvrE$, $couvrEs$, $couvrE$, $couvrONS$, $couvrEZ$, $couvrENT$ ‡parler‡: parle, parles, parle, parlons, parlez, parlent 2. Regular ~ir~ verbs plus maudire: is, is, it, issons, issez, issent Examples: ‡alunir‡: alunis, alunis, alunit, alunissons, alunissez, alunissent ‡finir‡: finis, finis, finit, finissons, finissez, finissent ‡maudire‡: $maudIs$, $maudIs$, $maudIt$, $maudISSons$, $maudISSez$, $maudISSent$ 3. Regular and certain irregular ~re~ verbs: s, s, _, ons, ez, ent Examples: ‡mordre‡: mords, mords, mord, mordons, mordez, mordent ‡rendre‡: rends, rends, rend, rendons, rendez, rendent ‡vaincre‡: vaincs, vaincs, vainc, $vainQUons$, $vainQUez$, $vainQUent$ 4. ‡Haïr (Québec)‡: ïs, ïs, ït, ïssons, ïssez, ïssent Example: haïs, haïs, haït, haïssons, haïssez, haïssent 5. The endings are s, s, t, ons, ez, ent for the following verbs: ‡absoudre‡, ‡accroître‡, ‡acquérir‡, ‡asseoir‡, ‡boire‡, ‡choir‡, ‡clore‡, ‡conduire‡, ‡connaître‡, ‡coudre‡, ‡courir‡, ‡croire‡, ‡croître‡, ‡écrire‡, ‡devoir‡, ‡dire‡, ‡exclure‡, ‡faire‡, ‡forclore‡, ‡fuir‡, ‡gésir‡, ‡inclure‡, ‡issir‡, ‡lire‡, ‡moudre‡, ‡mourir‡, ‡mouvoir‡, ‡naître‡, ‡ouïr (trad.)‡, ‡partir‡, ‡plaindre‡, ‡plaire‡, ‡pleuvoir‡, ‡pouvoir‡, ‡rire‡, ‡savoir‡, ‡suivre‡, ‡surseoir‡, ‡taire‡, ‡traire‡, ‡valoir‡, ‡venir‡, ‡vivre‡, ‡voir‡, ‡vouloir‡ Examples: ‡boire‡: bois, bois, boit, $bUVons$, $bUVez$, $boiVent$ ‡croître‡: $croÎs$, $croÎs$, $croÎt$, $croISSons$, $croISSez$, $croISSent$ ‡gésir‡: $gIs$, $gIs$, $gÎt$, $gIsons$, $gIsez$, $gIsent$ ‡ouïr (trad.)‡: $oIs$, $oIs$, $oIt$, $oYons$, $oYez$, $oIent$ ‡voir‡: $vOIs$, $vOIs$, $vOIt$, $vOYons$, $vOYez$, $vOIent$ Most of these verbs use irregular stems for some or all indicatif-présent conjugations. 6. Three verbs are fundamentally irregular in that their stems ~and~ endings are mostly unpredictable. These verbs are: ‡aller‡: $VAIS$, $VAs$, $VA$, $allons$, $allez$, $VOnt$ ‡avoir‡: $aI$, $As$, $A$, avons, avez, $Ont$ ‡être‡: $SUIs$, $Es$, $ESt$, $SOMMEs$, $êteS$, $SOnt$ Être, avoir, and aller are, respectively, the most, second-most, and eighth-most used verbs in French.
fr: `Utilisations` L’~indicatif présent~ est utilisé : • Pour décrire une réalité continue. « Mon mari prétend que je n’aime pas les fruits parce que j’en mange moins que lui. » = « My husband claims I don’t like fruit because I eat less of it than he does. » - Marcel Proust, Du côté de chez Swann • De même, pour exprimer le caractère répété ou habituel d’une action. L’anglais utilise parfois la structure ~have a habit of + gérondif~ pour accomplir cela. « [O]ù que je me trouve, dès qu’ils commencent à retenir et à se répondre, je l’$aperÇOis$, avec ses tilleuls et son trottoir éclairé par la lune. » = « Wherever I find myself, as soon as they begin to ring and answer each other, I see it, with its lindens and its moonlit sidewalk. » - Marcel Proust, Du côté de chez Swann • Pour mettre l’accent sur le caractère continu d’une action. L’anglais utilise la structure ~be + infinitif + -ing~ pour accomplir cela. « Vois-tu, je $saIs$ que tu m’attends. » = « You see, I know that you $ARE$ waiting for me. » - Victor Hugo, Demain dès l’aube • Dans les situations où l’anglais utilise la structure ~do + infinitif~ pour mettre l’accent. « Oh! très-sincèrement je $souffrE$ » = « Oh very sincerely do I suffer ! » - Charles Baudelaire, Le monstre, ou le paranymphe d’une nymphe macabre `Conjugaison` Pour la plupart des verbes, le radical de l’indicatif présent est l’infinitif sans la terminaison -er, -ir, -re ou -oir. Les terminaisons de l’indicatif présent de tout verbe appartiennent à l’une des catégories suivantes. 1. Verbes réguliers ~er~ plus les verbes couvrir, cueillir et bouillir : e, es, e, ons, ez, ent Exemples : ‡céder‡ : $cÈde$, $cÈdes$, $cÈde$, cédons, cédez, $cÈdent$ ‡couvrir‡ : $couvrE$, $couvrEs$, $couvrE$, $couvrONS$, $couvrEZ$, $couvrENT$ ‡parler‡ : parle, parles, parle, parlons, parlez, parlent 2. Verbes réguliers ~ir~ plus le verbe maudire : is, is, it, issons, issez, issent Exemples : ‡alunir‡ : alunis, alunis, alunit, alunissons, alunissez, alunissent ‡finir‡ : finis, finis, finit, finissons, finissez, finissent ‡maudire‡ : $maudIs$, $maudIs$, $maudIt$, $maudISSons$, $maudISSez$, $maudISSent$ 3. Verbes réguliers et certains verbes irréguliers ~re~ : s, s, _, ons, ez, ent Exemples : ‡mordre‡ : mords, mords, mord, mordons, mordez, mordent ‡rendre‡ : rends, rends, rend, rendons, rendez, rendent ‡vaincre‡ : vaincs, vaincs, vainc, $vainQUons$, $vainQUez$, $vainQUent$ 4. ‡Haïr (Québec)‡ : ïs, ïs, ït, ïssons, ïssez, ïssent Exemple : haïs, haïs, haït, haïssons, haïssez, haïssent 5. Les terminaisons sont s, s, t, ons, ez, ent pour les verbes suivants : ‡absoudre‡, ‡accroître‡, ‡acquérir‡, ‡asseoir‡, ‡boire‡, ‡choir‡, ‡clore‡, ‡conduire‡, ‡connaître‡, ‡coudre‡, ‡courir‡, ‡croire‡, ‡croître‡, ‡écrire‡, ‡devoir‡, ‡dire‡, ‡exclure‡, ‡faire‡, ‡forclore‡, ‡fuir‡, ‡gésir‡, ‡inclure‡, ‡issir‡, ‡lire‡, ‡moudre‡, ‡mourir‡, ‡mouvoir‡, ‡naître‡, ‡ouïr (trad.)‡, ‡partir‡, ‡plaindre‡, ‡plaire‡, ‡pleuvoir‡, ‡pouvoir‡, ‡rire‡, ‡savoir‡, ‡suivre‡, ‡surseoir‡, ‡taire‡, ‡traire‡, ‡valoir‡, ‡venir‡, ‡vivre‡, ‡voir‡, ‡vouloir‡ Exemples : ‡boire‡ : bois, bois, boit, $bUVons$, $bUVez$, $boiVent$ ‡croître‡ : $croÎs$, $croÎs$, $croÎt$, $croISSons$, $croISSez$, $croISSent$ ‡gésir‡ : $gIs$, $gIs$, $gÎt$, $gIsons$, $gIsez$, $gIsent$ ‡ouïr (trad.)‡ : $oIs$, $oIs$, $oIt$, $oYons$, $oYez$, $oIent$ ‡voir‡ : $vOIs$, $vOIs$, $vOIt$, $vOYons$, $vOYez$, $vOIent$ La plupart de ces verbes utilisent des radicaux irréguliers pour certaines ou toutes les conjugaisons de l’indicatif présent. 6. Trois verbes sont fondamentalement irréguliers dans la mesure où leurs radicaux ~et~ terminaisons sont pour la plupart imprévisibles. Ces verbes sont : ‡aller‡ : $VAIS$, $VAs$, $VA$, $allons$, $allez$, $VOnt$ ‡avoir‡ : $aI$, $As$, $A$, avons, avez, $Ont$ ‡être‡ : $SUIs$, $Es$, $ESt$, $SOMMEs$, $êteS$, $SOnt$ Être, avoir et aller sont respectivement au premier, au deuxième et au huitième rang quant à l’utilisation des verbes français.

# Info.irregularitiesHeading
source: Irregularities
fr: Irrégularités

# Info.irregularitiesText
source: Of the 6,314 verbs in ~Conjuguer~, 5,217 have conjugations that are completely regular. A completely regular conjugation uses the radical de l’infinitif as its stem, and the ending is completely predictable. These are verbs that are conjugated using verb models 1-1 (regular -er), 2-1 (regular -ir), and 5-1A (regular -re). Examples: ‡cacaber‡ -> vous cacabâtes ‡alunir‡ -> nous alunissons ‡épandre‡ -> épandu The other 1,097 verbs are conjugated using one of ninety-two irregular-verb models. Verb models exhibit irregularities in three ways. First, the stem used differs from the radical de l’infinitif, but the ending is predictable. Example: ‡suivre‡ -> je $suIs$ (~not~ suivs) Second, the stem is as expected, but the ending is unpredictable. Example: ‡être‡ -> vous $êteS$ (~not~ êtez) Third, both the stem ~and~ ending are unpredictable. Example: ‡aller‡ -> elles $VOnt$ (~not~ allent) ~Conjuguer~ represents stem alterations and unpredictable endings for verb models in the following manner: ~[tenses to apply this alteration to]~: ~[number of letters from end of radical de l’infinitif]~, ~[number of letters to replace]~, ~[letters to swap in]~ Here is an example. The model for ‡boire‡, 2-17, has the following alteration: r1p, r2p, b1p, b2p: 2, 2, UV This alteration results in the following conjugations: nous $bUVons$ (~not~ boions) vous $bUVez$ (~not~ boiez) nous $bUVions$ (~not~ boiions) vous $bUViez$ (~not~ boiiez) ~Conjuguer~ colors capital letters in alterations red, signifying irregularity. An asterisk at the end of letters to swap in means an unpredictable ending. For example, the model for ‡valoir‡, 4-5A, has the following alteration: r1s, r2s: 1, 1, UX* This alteration results in the following conjugations: je $vaUX$ (~not~ $vaUs$) tu $vaUX$ (~not~ $vaUs$) Here is how tenses are represented in the alterations: pp: participe passé rr: participe présent sf: radical du futur r1s, r2s, r3s, r1p, r2p, r3p: six person-numbers of the indicatif présent b1s, b2s, b3s, b1p, b2p, b3p: six person-numbers of the subjonctif présent x1s, x2s, x3s, x1p, x2p, x3p: six person-numbers of the passé simple i1s, i2s, i3s, i1p, i2p, i3p: six person-numbers of the imparfait q1s, q2s, q3s, q1p, q2p, q3p: six person-numbers of the subjonctif imparfait h2s, h1p, h2p: three person-numbers of the impératif The person-number ~A~ means “all six”. For example, xA is equivalent to x1s, x2s, x3s, x1p, x2p, x3p. Likewise, rA is equivalent to r1s, r2s, r3s, r1p, r2p, r3p. For example, the model for ‡avoir‡, 4-10, has the following alteration: xA: 2, 2, E This results in following passé-simple conjugations: $Eus$, $Eus$, $Eut$, $Eûmes$, $Eûtes$, $Eurent$ Some alterations have @ as the letter to swap in. This means “capitalize the first letter of the conjugation to indicate its irregularity”. For example, the model for ‡pouvoir‡, 4-6, has the following alteration: xA, pp: 4, 4, @ This results in following passé-simple conjugations: $Pus$, $Pus$, $Put$, $Pûmes$, $Pûtes$, $Purent$ The participe passé is $Pu$.
fr: Sur les 6 314 verbes que compte ~Conjuguer~, 5 217 ont des conjugaisons complètement régulières. Une conjugaison complètement régulière utilise le radical de l’infinitif comme radical, et la terminaison est tout à fait prévisible. Ce sont les verbes qui sont conjugués à l’aide des modèles de verbes 1-1 (régulier -er), 2-1 (régulier -ir) et 5-1A (régulier -re). Exemples : ‡cacaber‡ -> vous cacabâtes ‡alunir‡ -> nous alunissons ‡épandre‡ -> épandu Les 1 097 autres verbes sont conjugués à l’aide de l’un des quatre-vingt-douze modèles de verbes irréguliers. Les modèles verbaux présentent des irrégularités de trois manières. Premièrement, le radical utilisé diffère du radical de l’infinitif, mais la terminaison est prévisible. Exemple : ‡suivre‡ -> je $suIs$ (~pas~ suivs) Deuxièmement, le radical est conforme aux attentes, mais la terminaison est imprévisible. Exemple : ‡être‡ -> vous $êteS$ (~pas~ êtez) Troisièmement, le radical ~et~ la terminaison sont tous deux imprévisibles. Exemple : ‡aller‡ -> elles $VOnt$ (~pas~ allent) ~Conjuguer~ représente les altérations des radicaux et les terminaisons imprévisibles des modèles verbaux de la manière suivante : ~[temps auxquels s’applique cette altération]~: ~[nombre de lettres à partir de la fin du radical de l’infinitif]~, ~[nombre de lettres à remplacer]~, ~[lettres de remplacement]~ Voici un exemple. Le modèle de ‡boire‡, 2-17, a l’altération suivante : r1p, r2p, b1p, b2p: 2, 2, UV Cette altération entraîne les conjugaisons suivantes : nous $bUVons$ (~pas~ boions) vous $bUVez$ (~pas~ boiez) nous $bUVions$ (~pas~ boiions) vous $bUViez$ (~pas~ boiiez) ~Conjuguer~ colore en rouge les lettres majuscules dans les altérations, signifiant les irrégularités. Un astérisque à la fin des lettres de remplacement signifie une terminaison imprévisible. Par exemple, le modèle du verbe ‡valoir‡, 4-5A, a l’altération suivante : r1s, r2s: 1, 1, UX* Cette altération entraîne les conjugaisons suivantes : je $vaUX$ (~pas~ $vaUs$) tu $vaUX$ (~pas~ $vaUs$) Voici comment les temps sont représentés dans les altérations : pp : participe passé rr : participe présent sf : radical du futur r1s, r2s, r3s, r1p, r2p, r3p : six nombres-personnes de l’indicatif présent b1s, b2s, b3s, b1p, b2p, b3p : six nombres-personnes du subjonctif présent x1s, x2s, x3s, x1p, x2p, x3p : six nombres-personnes du passé simple i1s, i2s, i3s, i1p, i2p, i3p : six nombres-personnes de l’imparfait q1s, q2s, q3s, q1p, q2p, q3p : six nombres-personnes du subjonctif imparfait h2s, hlp, h2p : trois nombres-personnes de l’impératif La nombre-personne ~A~ signifie « tous les six ». Par exemple, xA est équivalent à x1s, x2s, x3s, x1p, x2p, x3p. De même, rA est équivalent à r1s, r2s, r3s, r1p, r2p, r3p. Par exemple, le modèle du verbe ‡avoir‡, 4-10, a l’altération suivante : xA: 2, 2, E Cela entraîne les conjugaisons passé-simples suivantes : $Eus$, $Eus$, $Eut$, $Eûmes$, $Eûtes$, $Eurent$ Certaines altérations ont @ comme lettre de remplacement. Cela signifie « mettre en majuscule la première lettre de la conjugaison pour indiquer son irrégularité ». Par exemple, le modèle du verbe ‡pouvoir‡, 4-6, a l’altération suivante : xA, pp: 4, 4, @ Cela entraîne les conjugaisons passé-simples suivantes : $Pus$, $Pus$, $Put$, $Pûmes$, $Pûtes$, $Purent$ Le participe passé est $Pu$.

# Info.participePasséText
source: `Use` The ~participe passé~ (past participle) is used with the auxiliary verbs ~avoir~ and ~être~ to form certain compound tenses, including the ‡passé composé‡: “j’ai parlé” = “I $spOke$”, “I $dID$ speak”, or “I have $spOken$”. The participe passé is also used to form an adjective or noun from a verb: “temps perdu” = “lost time”, “l’$inconNu$” = “the unknown”. `Form` In general, the participe passé is formed by adding the following endings to the radical de l’infinitif: Regular ~er~ verbs: -é Examples: “parlé” = “$spOken$”, “chanté” = “$sUng$”, “dansé” = “danced” Regular ~ir~ verbs: -i Examples: “fini” = “finished”, “établi” = “established”, “évanoui” = “fainted” Regular ~re~ verbs: -u Examples: “entendu” = “heard”, “vendu” = “$sOld$”, “rendu” = “rendered” `Agreement` When the participe passé is used as an adjective, it agrees in both gender and number with the noun it modifies. Example: “des langues parlées en France” = “some languages $spOken$ in France” The participe passé, used in compound tenses, agrees in gender and number with the subject in two scenarios. One scenario involves reflexive use of verbs. “Les chattes se sont nettoyées.” = “The female cats groomed themselves.” The other scenario involves certain verbs that use the auxiliary ‡être‡ rather than ‡avoir‡: ‡aller‡, ‡arriver‡, ‡descendre‡, ‡devenir‡, ‡entrer‡, ‡issir‡, ‡monter‡, ‡mourir‡, ‡naître‡, ‡partir‡, ‡parvenir‡, ‡passer‡, ‡ressortir‡, ‡rester‡, ‡retomber‡, ‡retourner‡, ‡revenir‡, ‡sortir (exit)‡, and ‡tomber‡. Confusingly, verbs in this list use ‡avoir‡, without agreement, in transitive situations. Contrast: “Elle est sortie.” = “She $leFt$.” with: “Elle a sorti son portefeuille.” = “She $gOt$ her wallet out.” Note the absence of agreement in the second conjugation of sortir. `Irregularities` Here are some irregular participes passés: ‡absoudre‡ -> $absouS$ ‡acquérir‡ -> $acquIs$ ‡asseoir‡ -> $assIS$ ‡avoir‡ -> $EU$ ‡boire‡ -> $bU$ ‡comprendre‡ -> $comprIS$ ‡connaître‡ -> $connU$ ‡coudre‡ -> $couSu$ ‡couvrir‡ -> $couvERT$ ‡croire‡ -> $crU$ ‡croître‡ -> $crÛ$ ‡devoir‡ -> $DÛ$ ‡dire‡ -> $diT$ ‡être‡ -> $ÉtÉ$ ‡exclure‡ -> $exclU$ ‡faire‡ -> $faiT$ ‡falloir‡ -> $fallU$ ‡gésir‡ -> $gÉÜ$ ‡issir‡ -> $issU$ ‡lire‡ -> $lU$ ‡mettre‡ -> $mIS$ ‡moudre‡ -> $mouLu$ ‡mourir‡ -> $moRT$ ‡mouvoir‡ -> $MÛ$ ‡nuire‡ -> $nuI$ ‡ouvrir‡ -> $ouvERT$ ‡plaindre‡ -> $plainT$ ‡plaire‡ -> $plU$ ‡pleuvoir‡ -> $plU$ ‡pouvoir‡ -> $PU$ ‡prendre‡ -> $prIS$ ‡promouvoir‡ -> $promU$ ‡recevoir‡ -> $reÇU$ ‡résoudre‡ -> $résoLu$ ‡rire‡ -> $rI$ ‡savoir‡ -> $sU$ ‡suffire‡ -> $suffI$ ‡suivre‡ -> $suivIS$ ‡surseoir‡ -> $sursIS$ ‡tenir‡ -> $tenU$ ‡venir‡ -> $venU$ ‡vivre‡ -> $vÉCu$ ‡vouloir‡ -> $voulU$ Verbs derived from the above verbs use variants of these irregular participes passés. Example: ‡ravoir‡ -> $rEU$
fr: `Utilisation` Le ~participe passé~ est utilisé avec les verbes auxiliaires ~avoir~ et ~être~ pour former certains temps composés, dont le ‡passé composé‡ : « j’ai parlé » = « I $spOke$ », « I $dID$ speak » ou « I have $spOken$ ». Le participe passé est également utilisé pour former un adjectif ou un nom à partir d’un verbe : « temps perdu » = « lost time », « l’$inconNu$ » = « the unknown ». `Forme` En général, le participe passé se forme en ajoutant les terminaisons suivantes au radical de l’infinitif : Les verbes réguliers avec ~er~ : -é Exemples : « parlé » = « $spOken$ », « chanté » = « $sUng$ », « dansé » = « danced » Les verbes réguliers avec ~ir~ : -i Exemples : « fini » = « finished », « établi » = « established », « évanoui » = « fainted » Les verbes réguliers avec ~re~ : -u Exemples : « entendu » = « heard », « vendu » = « $sOld$ », « rendu » = « rendered » `Accord` Lorsque le participe passé est utilisé comme adjectif, il s’accorde en genre et en nombre avec le nom qu’il modifie. Exemple : « des langues parlées en France » = « some languages ​​$spOken$ in France » Le participe passé, utilisé aux temps composés, s’accorde en genre et en nombre avec le sujet dans deux situations. Une situation implique l’utilisation réflexive des verbes. “Les chattes se sont nettoyées.” = « The female cats groomed themselves. » L’autre situation implique certains verbes qui utilisent l’auxiliaire ‡être‡ plutôt que ‡avoir‡ : ‡aller‡, ‡arriver‡, ‡descendre‡, ‡devenir‡, ‡entrer‡, ‡issir‡, ‡monter‡, ‡mourir‡, ‡naître‡, ‡partir‡, ‡parvenir‡, ‡passer‡, ‡ressortir‡, ‡rester‡, ‡retomber‡, ‡retourner‡, ‡revenir‡, ‡sortir (exit)‡ et ‡tomber‡. Il est à noter que les verbes de cette liste utilisent ‡avoir‡, sans accord, dans les situations transitives. Comparez : « Elle est sortie. » = « Elle $leFt$. » avec : « Elle a sorti son portefeuille. » = « She $gOt$ her wallet out. » On constate l’absence d’accord dans la deuxième conjugaison de sortir. `Irrégularités` Voici quelques participes passés irréguliers : ‡absoudre‡ -> $absouS$ ‡acquérir‡ -> $acquIs$ ‡asseoir‡ -> $assIS$ ‡avoir‡ -> $EU$ ‡boire‡ -> $bU$ ‡comprendre‡ -> $comprIS$ ‡connaître‡ -> $connU$ ‡coudre‡ -> $couSu$ ‡couvrir‡ -> $couvERT$ ‡croire‡ -> $crU$ ‡croître‡ -> $crÛ$ ‡devoir‡ -> $DÛ$ ‡dire‡ -> $diT$ ‡être‡ -> $ÉtÉ$ ‡exclure‡ -> $exclU$ ‡faire‡ -> $faiT$ ‡falloir‡ -> $fallU$ ‡gésir‡ -> $gÉÜ$ ‡issir‡ -> $issU$ ‡lire‡ -> $lU$ ‡mettre‡ -> $mIS$ ‡moudre‡ -> $mouLu$ ‡mourir‡ -> $moRT$ ‡mouvoir‡ -> $MÛ$ ‡nuire‡ -> $nuI$ ‡ouvrir‡ -> $ouvERT$ ‡plaindre‡ -> $plainT$ ‡plaire‡ -> $plU$ ‡pleuvoir‡ -> $plU$ ‡pouvoir‡ -> $PU$ ‡prendre‡ -> $prIS$ ‡promouvoir‡ -> $promU$ ‡recevoir‡ -> $reÇU$ ‡résoudre‡ -> $résoLu$ ‡rire‡ -> $rI$ ‡savoir‡ -> $sU$ ‡suffire‡ -> $suffI$ ‡suivre‡ -> $suivIS$ ‡surseoir‡ -> $sursIS$ ‡tenir‡ -> $tenU$ ‡venir‡ -> $venU$ ‡vivre‡ -> $vÉCu$ ‡vouloir‡ -> $voulU$ Les verbes dérivés des verbes ci-dessus utilisent des variantes de ces participes passés irréguliers. Exemple : ‡ravoir‡ -> $rEU$

# Info.participePrésentText
source: `Uses` The ~participe présent~ (present participle) is used: • As an invariable verb referring to a noun or pronoun. “[M]es parents, n’$aYant$ guère de loisir pour faire des sorties … prirent l’habitude de me laisser aller me promener sans eux.” = “My parents, having little time to go out … $gOt$ into the habit of letting me go for a walk without them.” - Marcel Proust, Du côté de chez Swann • In a participle clause. “Il n’avait … aucune raison de haïr ce bon Charles, n’$Étant$ pas ce qui s’appelle dévoré de jalousie.” = “He $haD$ … no reason to hate good Charles, not being … devoured by jealousy.” - Gustave Flaubert, Madame Bovary • Or as an adjective. In this case, the participe présent agrees with the noun being modified. “Gervaise avait gardé sa tranquillité souriante de la matinée.” = “Gervaise $haD$ kept her smiling tranquility of the morning.” - Émile Zola, L’assommoir `Form` The participe présent is formed from the 1p indicatif-présent conjugation, minus -ons, plus -ant. Examples: ‡parler‡ -> parlant ‡finir‡ -> finissant ‡rendre‡ -> rendant Three participes présents do not follow this pattern and are therefore irregular: ‡avoir‡ -> $aYant$ ‡être‡ -> $Étant$ ‡savoir‡ -> $saCHant$
fr: `Utilisations` Le ~participe présent~ est utilisé : • En tant que verbe invariable se référant à un nom ou à un pronom. « [M]es parents, n’$aYant$ rarement de loisir pour faire des sorties … prirent l’habitude de me laisser aller me promener sans eux. » = « My parents, having little time to go out … $gOt$ into the habit of letting me go for a walk without them. » - Marcel Proust, Du côté de chez Swann • Dans une proposition participale. « Il n’avait … aucune raison de haïr ce bon Charles, n’$Étant$ pas ce qui s’appelle dévoré de jalousie. = « He $haD$ … no reason to hate good Charles, not being … devoured by jealousy. » - Gustave Flaubert, Madame Bovary • Ou comme un adjectif. Dans ce cas, le participant présent s’accorde avec le nom à modifier. « Gervaise avait gardé sa tranquillité souriante de la matinée. » = « Gervaise $haD$ kept her smiling tranquility of the morning. » - Émile Zola, L’assommoir `Forme` Le participe présent est formé par la conjugaison 1p de l’indicatif présent, sans -ons, main en ajoutant -ant. Exemples : ‡parler‡ -> parlant ‡finir‡ -> finissant ‡rendre‡ -> rendant Trois participes présents ne suivent pas ce schéma et sont donc irréguliers : ‡avoir‡ -> $aYant$ ‡être‡ -> $Étant$ ‡savoir‡ -> $saCHant$
